#####################################################
# 1) Создать список из 20 случайных целых чисел в диапазоне от 1 до 100.
# Задание можно выполнить и через обычный цикл и через генератор списков.

#####################################################
# 2) Создать словарь triangle в который записать точки A B C (ключи),
# и их координаты - кортежи (значения), созданные случайным образом с помощью модуля random
# в диапазоне от -100 до 100 по каждой оси.

#####################################################
# 3) Создать функцию print_stars, которая принимает в виде параметра строку и печатает ее
# с тремя символами * вначале и в конце строки.
# Пример:
# my_str = "I'm the string"
# print_stars(my_str)
# Печатает ***I'm the string***

#####################################################
# Задания 4 и 5 выполнять с помощью циклов
# 4) Дан список словарей persons в формате [{"name": "John", "age": 15}, ... ,{"name": "Jack", "age": 45}]
# а) Напечатать имя самого молодого человека. Если возраст совпадает - напечатать все имена с этим возрастом.

#####################################################
# Задания 4 и 5 выполнять с помощью циклов
# 4) Дан список словарей persons в формате [{"name": "John", "age": 15}, ... ,{"name": "Jack", "age": 45}]
# б) Напечатать самое длинное имя. Если длина имени совпадает - напечатать все имена этой длинны.

#####################################################
# Задания 4 и 5 выполнять с помощью циклов
# 4) Дан список словарей persons в формате [{"name": "John", "age": 15}, ... ,{"name": "Jack", "age": 45}]
# в) Посчитать среднее количество лет всех людей из списка.

#####################################################
# Задания 4 и 5 выполнять с помощью циклов
# 5) Даны два словаря my_dict_1 и my_dict_2.
# а) Создать список из ключей, которые есть в обоих словарях.

#####################################################
# Задания 4 и 5 выполнять с помощью циклов
# 5) Даны два словаря my_dict_1 и my_dict_2.
# б) Создать список из ключей, которые есть в первом, но нет во втором словаре.

#####################################################
# Задания 4 и 5 выполнять с помощью циклов
# 5) Даны два словаря my_dict_1 и my_dict_2.
# в) Создать новый словарь из пар {ключ:значение}, для ключей, которые есть в первом, но нет во втором словаре.

#####################################################
# Задания 4 и 5 выполнять с помощью циклов
# 5) Даны два словаря my_dict_1 и my_dict_2.
# г) Объединить эти два словаря в новый словарь по правилу:
# если ключ есть только в одном из двух словарей - поместить пару ключ:значение,
# если ключ есть в двух словарях - поместить пару {ключ: [значение_из_первого_словаря, значение_из_второго_словаря]},